<?php if ( ! defined( 'DEVIL_SYS_CORE_PATH') ) exit( 'No direct script access allowed' );
/**
  @brief        My_HtmlView ( 繼承核心 HtmlView 類別 )
**/

class My_HtmlView extends HtmlView
{
    /**
    @brief      呼叫父類別的建構子
    **/
    public function __construct()
    {
        parent::__construct();
    }

    /**
    @brief      秀出處理完的資料 ( 靜態 HTML Head 頁面 )
    @return     String      資料陣列
    **/
    public function Extension_UI_HeaderHtmlView()
    {
        # ----------------------------------------------------------------------
        # 初始化變數
        # ----------------------------------------------------------------------
        $debug = '';
        # ----------------------------------------------------------------------
        # JS計算秒數用
        # ----------------------------------------------------------------------
        if ( DEVIL_APP_ENVIRONMENT == 'development' )
        {
            $debug .= " var debug_start = " . DEVIL_APP_JAVSCRIPT_START . ";\n";
            $debug .= " var debug_end = " . DEVIL_APP_JAVSCRIPT_END . ";\n";
        }
        # ----------------------------------------------------------------------
        # 組合要存放到前台給JS用的參數
        # ----------------------------------------------------------------------
        $JAVASCRIPTVAR = $debug
            # ------------------------------------------------------------------
            # 產生 ddom        當前的網址的 JS 變數
            # ------------------------------------------------------------------
            . " var ddom = '" . DEVIL_APP_Url . "';\n"
            # ------------------------------------------------------------------
            # 產生 ddom public 當前的網址的 JS 變數
            # ------------------------------------------------------------------
            . " var jpublic = '" . DEVIL_APP_PUBLIC_URL . "';\n"
            # ------------------------------------------------------------------
            # 所有帳號設定密碼時  最小幾碼
            # ------------------------------------------------------------------
            . " var leastPass = " . DEVIL_APP_LEASTPASS . ";\n"
            # ------------------------------------------------------------------
            # 所有帳號設定密碼時  最大幾碼
            # ------------------------------------------------------------------
            . " var maximumPass = " . DEVIL_APP_MAXPASS . ";\n";
        # ----------------------------------------------------------------------
        # 回傳結果
        # ----------------------------------------------------------------------
        return $this->render
        (
            "Core_UI_Header_Page" ,
            "Core_UI_Header_Page.html" ,
            array
            (
                # --------------------------------------------------------------
                # 當前網址
                # --------------------------------------------------------------
                "URL" => DEVIL_APP_Url ,
                # --------------------------------------------------------------
                # JS、CSS、圖片等的存取網址
                # --------------------------------------------------------------
                "PUBLIC_URL" => DEVIL_APP_PUBLIC_URL ,
                # --------------------------------------------------------------
                # 網頁 TITLE
                # --------------------------------------------------------------
                "TITLE" => DEVIL_APP_PROJECT_NAME ,
                # --------------------------------------------------------------
                # 當前登入者的名稱
                # --------------------------------------------------------------
                "USERNAME" => Core_LoadSession( 'name' ) ,
                # --------------------------------------------------------------
                # JAVASCRIPT 用的變數
                # --------------------------------------------------------------
                "JAVASCRIPTVAR" => $JAVASCRIPTVAR ,
            ) ,
            true
        );
    }

    /**
    @brief      秀出處理完的資料 ( 靜態 HTML Floot 頁面 )
    @return     String      資料陣列
    **/
    public function Extension_UI_FlootHtmlView()
    {
        return $this->render
        (
            "Core_UI_Floot_Page" ,
            "Core_UI_Floot_Page.html" ,
            array
            (
                # --------------------------------------------------------------
                # 當前網址
                # --------------------------------------------------------------
                "URL" => DEVIL_APP_Url ,
                # --------------------------------------------------------------
                # JS、CSS、圖片等的存取網址
                # --------------------------------------------------------------
                "PUBLIC_URL" => DEVIL_APP_PUBLIC_URL ,
                # --------------------------------------------------------------
                # 網頁 TITLE
                # --------------------------------------------------------------
                "TITLE" => DEVIL_APP_PROJECT_NAME ,
                # --------------------------------------------------------------
                # 檢查是否已登入
                # --------------------------------------------------------------
                "ISLOGINURL" => DEVIL_APP_Url.'BuyCart/ISLogin' ,
                # --------------------------------------------------------------
                # 詳細訂單
                # --------------------------------------------------------------
                "BUYCART" => DEVIL_APP_Url.'BuyCart' ,
            ) ,
            true
        );
    }

    /**
    @brief      秀出中間部份處理的資料 ( 靜態 HTML 頁面 ,可用在ajax load)
    @param      String      $block 區塊名稱
    @param      String      $file 檔案名稱
    @param      Array       $dataArr 資料陣列
    **/
    public function Extension_HtmlDataView( $block = null , $file = null , $dataArr = null )
    {
        # ----------------------------------------------------------------------
        # 處理 content 區塊資料
        # ----------------------------------------------------------------------
        return $this->render( $block , $file , $dataArr , true );
    }

    /**
    @brief      秀出處理完的資料 ( 靜態 HTML 頁面 )
    @param      String      $block 區塊名稱
    @param      String      $file 檔案名稱
    @param      Array       $dataArr 資料陣列
    **/
    public function Extension_HtmlView( $block = null , $file = null , $dataArr = null )
    {
        # ----------------------------------------------------------------------
        # 處理 Header  區塊資料
        # ----------------------------------------------------------------------
        echo $this->Extension_UI_HeaderHtmlView();
        # ----------------------------------------------------------------------
        # 處理 content 區塊資料
        # ----------------------------------------------------------------------
        echo $this->Extension_HtmlDataView( $block , $file , $dataArr );
        # ----------------------------------------------------------------------
        # 顯示除錯器 ( 開發模式才會出現 )
        # ----------------------------------------------------------------------
        if ( DEVIL_APP_ENVIRONMENT == 'development' && DEVIL_APP_DEBUGMETHOD == 'debugbar' )
        {
            Bootstart::$_debug->displayInfo();
        }
        # ----------------------------------------------------------------------
        # 處理 Flooter 區塊資料
        # ----------------------------------------------------------------------
        echo $this->Extension_UI_FlootHtmlView();
        exit;
    }
}