<?php if ( ! defined( 'DEVIL_SYS_CORE_PATH' ) ) exit( 'No direct script access allowed' );
/**
  @brief        ★★★★★ 核心 Controller ( 控制器父類別-抽象類別 )
  @version      1.0.0
  @date         2015-04-15 by Vam
  @since        1.0.1 -> 針對 __backstageInit()的共用方法加入除錯機制。
  @since        1.0.0 -> 新增此新類別。
**/

abstract class Controller
{
    /**
    @cond       建構子
    @remarks    利用建構子產生類別
    **/
    public function __construct()
    {
        # ----------------------------------------------------------------------
        # 利用建構子產生二維物件資料到當前的專案
        # ----------------------------------------------------------------------
        self::__initialization();
    }
    /**
    @endcond
    **/

    /**
    @cond       所有控制器必須要實作的方法
    **/
    abstract public function index();
    /**
    @endcond
    **/

    /**
    @brief      利用建構子產生二維物件資料到當前的專案
    **/
    public function __initialization()
    {
        # ----------------------------------------------------------------------
        # 迴圈處理資料
        # ----------------------------------------------------------------------
        foreach( Bootstart::$_lib as $k => $v )
        {
            $this->$k = $v;
        }
        # ----------------------------------------------------------------------
        # 迴圈處理資料
        # ----------------------------------------------------------------------
        foreach( Bootstart::$_mod as $k => $v )
        {
            $this->$k = $v;
        }
    }

    /**
    @brief      登入判斷出始化，因為登入頁不連資料庫
    @param      $_debug         除錯用功能，預設值為 false 若設定為 true 時則直接輸出被登出的錯誤提示原因。
    @remarks    控制器共用的函式
    @code{.unparsed}
    $this->__backstageInit();
    @endcode
    **/
    protected function __backstageInit( $_debug = false )
    {
        # ----------------------------------------------------------------------
        # 先驗證登入後產生的 _c_chk 是不是偽造的
        # ----------------------------------------------------------------------
        if ( ! Core_IsLoginCookie() )
        {
            # ------------------------------------------------------------------
            # 如果是除錯模式，就顯示錯誤代碼及描述。
            # ------------------------------------------------------------------
            if ( $_debug )
            {
                Core_Export( '401 - Cookie 不合法。' );
            }
            # ------------------------------------------------------------------
            # 一定要先清空 session 再轉跳，原因是怕沒有執行到登入程序
            # 如果有 Core_Session 再執行 session_destroy() 避免出現錯誤訊息
            # 原因是使用 session_destroy() 之前必須要搭配 session_start()
            # ------------------------------------------------------------------
            if ( isset( $this->Core_Session ) )
            {
                session_destroy();
            }
            # ------------------------------------------------------------------
            # 如果是 Ajax 要資料的話
            # ------------------------------------------------------------------
            if ( Core_IsAjax() )
            {
                # --------------------------------------------------------------
                # 讓前台登出的 header
                # --------------------------------------------------------------
                header( "HTTP/1.1 401" );
                exit;
            }
            else
            {
                Core_Redirect( 'Login/logout' );
            }
        }
        # ----------------------------------------------------------------------
        # 建構類別
        # ----------------------------------------------------------------------
        self::__initialization();
        # ----------------------------------------------------------------------
        # 載入系統設定 CLASS
        # ----------------------------------------------------------------------
        Bootstart::$_lib['Core_Loader']->library( array( 'Pdo_Driver' , 'Session' ) );
        # ----------------------------------------------------------------------
        # 如果沒有設定 SESSION ID 就登出
        # ----------------------------------------------------------------------
        if ( ! isset( $_SESSION['Login_user']['id'] ) )
        {
            # ------------------------------------------------------------------
            # 如果是除錯模式，就顯示錯誤代碼及描述。
            # ------------------------------------------------------------------
            if ( $_debug )
            {
                Core_Export( '403 - SESSION ID 不存在。' );
            }
            # ------------------------------------------------------------------
            # 一定要先清空 session 再轉跳，原因是怕沒有執行到登入程序
            # ------------------------------------------------------------------
            session_destroy();
            # ------------------------------------------------------------------
            # 如果是 Ajax 要資料的話
            # ------------------------------------------------------------------
            if ( Core_IsAjax() )
            {
                # --------------------------------------------------------------
                # 讓前台登出的 header
                # --------------------------------------------------------------
                header( "HTTP/1.1 403" );
                exit;
            }
            else
            {
                Core_Redirect( 'Login/logout' );
            }
        }
        else
        {
            # ------------------------------------------------------------------
            # 載入資料模組
            # ------------------------------------------------------------------
            Bootstart::$_lib['Core_Loader']->model( array( 'Users' , 'KConfig' ) );
            # ------------------------------------------------------------------
            # 另外載入系統設定 CLASS
            # ------------------------------------------------------------------
            Bootstart::$_lib['Core_Loader']->library( array( 'Power' ) );
            # ------------------------------------------------------------------
            # 如果開啟全系統維護中的話，只有 "超級帳號" 可以看的到
            # ------------------------------------------------------------------
            if ( Bootstart::$_mod['KConfig_Model']->Get( 'systemcheck' ) && Core_LoadSession( 'account' ) !== DEVIL_APP_SUPERACCOUNT )
            {
                # --------------------------------------------------------------
                # 如果是除錯模式，就顯示錯誤代碼及描述。
                # --------------------------------------------------------------
                if ( $_debug )
                {
                    Core_Export( '503 - 全系統維護中。' );
                }
                # --------------------------------------------------------------
                # 一定要先清空 session 再轉跳，原因是怕沒有執行到登入程序
                # --------------------------------------------------------------
                session_destroy();
                # --------------------------------------------------------------
                # 如果是 Ajax 要資料的話
                # --------------------------------------------------------------
                if ( Core_IsAjax() )
                {
                    # ----------------------------------------------------------
                    # 讓前台登出的 header
                    # ----------------------------------------------------------
                    header( "HTTP/1.1 503" );
                    exit;
                }
                else
                {
                    Core_Redirect( 'Login/logout' );
                }
            }
            # ------------------------------------------------------------------
            # 如果被設定停用，會被登出 ( 超級帳號不限制 )
            # ------------------------------------------------------------------
            if ( Bootstart::$_mod['Users_Model']->getStates( Core_LoadSession( 'id' ) ) && Core_LoadSession( 'account' ) !== DEVIL_APP_SUPERACCOUNT )
            {
                # --------------------------------------------------------------
                # 如果是除錯模式，就顯示錯誤代碼及描述。
                # --------------------------------------------------------------
                if ( $_debug )
                {
                    Core_Export( '406 - 此帳號目前禁止登入。' );
                }
                # --------------------------------------------------------------
                # 一定要先清空 session 再轉跳，原因是怕沒有執行到登入程序
                # --------------------------------------------------------------
                session_destroy();
                # --------------------------------------------------------------
                # 如果是 Ajax 要資料的話
                # --------------------------------------------------------------
                if ( Core_IsAjax() )
                {
                    # ----------------------------------------------------------
                    # 讓前台登出的 header
                    # ----------------------------------------------------------
                    header( "HTTP/1.1 406" );
                    exit;
                }
                else
                {
                    Core_Redirect( 'Login/logout' );
                }
            }
            # ------------------------------------------------------------------
            # 更新SESSION滯留的時間，代表使用者有切換功能
            # ------------------------------------------------------------------
            Bootstart::$_lib['Core_Session']->sess_UserUpdate();
        }
    }

    /*
        @brief 送出 JSON 格式資料給 Client 端
    */
    public function responseJSON( $data = array(), $httpStatusCode = 200, $message = '', $pagination = null )
    {
        $prepareData = [
            'code' => $httpStatusCode ,
            'message' => $message,
            'data' => $data
        ];

        // 分頁參數
        $args = func_get_args();
        if( isset($args[3]) ) {
            $prepareData['pagination'] = $pagination;
        }

        echo json_encode( $prepareData );
        exit;
    }
}