<?php if ( ! defined( 'DEVIL_SYS_CORE_PATH' ) ) exit( 'No direct script access allowed' );
/**
  @brief        OrderData Model ( 訂單管理模組 )
**/

class OrderData_Model extends Model
{
    /**
    @brief      建構子
    **/
    public function __construct()
    {
        parent::__construct();
    }

    /**
    @brief      取得所有商品
    @retval     Mix / FALSE
    **/
    public function getOrderdata( $_id = 0, $_type = 1, $_page = 1 )
    {
        # ----------------------------------------------------------------------
        # 組合SQL語法
        # ----------------------------------------------------------------------
        $sql = "SELECT * FROM  `orderdata` WHERE `user_id` = {$_id}" ;
        # ----------------------------------------------------------------------
        # 執行查詢結果
        # ----------------------------------------------------------------------
        $result = Bootstart::$_lib['Core_Pdo_Driver']->pagination
        (
            DEVIL_APP_Url . 'Order/index/list/',
            $sql ,
            array(  ) ,
            'ORDER BY `createtime` DESC' ,
            intval( $_page ) ,
            20
        );
        # ----------------------------------------------------------------------
        # 防呆判斷
        # ----------------------------------------------------------------------
        if ( ! $result )
        {
            return false;
        }
        else
        {
            # ------------------------------------------------------------------
            # 回傳資料集
            # ------------------------------------------------------------------
            return $result;
        }
    }

    /**
    @brief      取得指定商號商品
    @retval     Mix / FALSE
    **/
    public function getOrderdataById( $_id = 1 )
    {
        # ----------------------------------------------------------------------
        # 組合SQL語法
        # ----------------------------------------------------------------------
        $sql = "SELECT * FROM  `orderdata` WHERE `id` = {$_id} ";
        # ----------------------------------------------------------------------
        # 執行查詢結果
        # ----------------------------------------------------------------------
        $result = $this->db->query( $sql );
        # ----------------------------------------------------------------------
        # 防呆判斷
        # ----------------------------------------------------------------------
        if ( ! $result )
        {
            return false;
        }
        else
        {
            # ------------------------------------------------------------------
            # 回傳資料集
            # ------------------------------------------------------------------
            return $result->fetch();
        }
    }
}