<?php if ( ! defined( 'DEVIL_SYS_CORE_PATH' ) ) exit( 'No direct script access allowed' );
/**
  @brief        Account Controller ( 我的帳號 )
**/

class Account extends Controller
{
    /**
    @brief      建構子
    **/
    public function __construct()
    {
        # ----------------------------------------------------------------------
        # 呼叫 "父類別" 的 __backstageInit Method
        # ----------------------------------------------------------------------
        $this->__backstageInit();
        # ----------------------------------------------------------------------
        # 手動載入需要的類別
        # ----------------------------------------------------------------------
        //Bootstart::$_lib[ 'Core_Loader' ]->model( array( 'User' ) );
        # ----------------------------------------------------------------------
        # 重新建構類別
        # ----------------------------------------------------------------------
        $this->__initialization();
    }

    /**
    @brief      登入後 看到的第一頁 ( 首頁 )
    **/
    public function index(  )
    {

    }

    /**
    @brief      修改密碼
    **/
    public function Change_Password( )
    {
        # ----------------------------------------------------------------------
        # 輸出內容
        # ----------------------------------------------------------------------
        $this->My_HtmlView->Extension_HtmlView
        (
            "Change_Password_Page" ,
            "Change_Password.html" ,
            array
            (
                # --------------------------------------------------------------
                # 站名
                # --------------------------------------------------------------
                "TITLE" => DEVIL_APP_PROJECT_NAME ,
                # --------------------------------------------------------------
                # JS、CSS、圖片等的存取網址
                # --------------------------------------------------------------
                "PUBLIC_URL" => DEVIL_APP_PUBLIC_URL ,
                # --------------------------------------------------------------
                # 當前網址
                # --------------------------------------------------------------
                "URL" => DEVIL_APP_Url ,
                # --------------------------------------------------------------
                # 修改路径
                # --------------------------------------------------------------
                "POST_URL" => DEVIL_APP_Url . __CLASS__ . '/Change_Password_post',
            )
        );
    }

    /**
    @brief      修改密碼處理
    **/
    public function Change_Password_post( )
    {
        if ( Core_IsPost() && $_POST != '' )
        {
            # ------------------------------------------------------------------
            # 手動載入需要的類別
            # ------------------------------------------------------------------
            Bootstart::$_lib[ 'Core_Loader' ]->model( array( 'Users' ) );
            # ------------------------------------------------------------------
            # 取出當前使用者資料
            # ------------------------------------------------------------------
            $tempArr = $this->Users_Model->getCurrentUsers( Core_LoadSession( 'id' ) );
            # ------------------------------------------------------------------
            # 舊密碼
            # ------------------------------------------------------------------
            $oldpassword = $_POST[ 'oldpassword' ];
            # ------------------------------------------------------------------
            # 如果舊密碼不同，就塞錯誤訊息
            # ------------------------------------------------------------------
            if ( md5( $oldpassword ) != $tempArr['pass'] )
            {
                show_errormsg( '舊密碼錯誤！！' );
            }
            # ------------------------------------------------------------------
            # 新密碼
            # ------------------------------------------------------------------
            $newpassword = $_POST[ 'newpassword' ];
            # ------------------------------------------------------------------
            # 再次確認新密碼
            # ------------------------------------------------------------------
            $renewpassword = $_POST[ 'renewpassword' ];
            # ------------------------------------------------------------------
            # 判斷新密碼,重複輸入新密碼比對有沒有一樣
            # ------------------------------------------------------------------
            if ( $newpassword !== $renewpassword )
            {
                show_errormsg( '新密碼需與再次输入新密碼相同！！' );
            }
            # ------------------------------------------------------------------
            # 執行
            # ------------------------------------------------------------------
            if ( $this->Users_Model->Set_Passwd( MD5( $newpassword ) ) )
            {
                Core_Redirect( 'Home' );
            }
        }
        else
        {
            Core_Redirect( 'Home' );
        }
    }

    /**
    @brief      查訂單
    **/
    public function Order( )
    {
        # ----------------------------------------------------------------------
        # 手動載入需要的類別
        # ----------------------------------------------------------------------
        Bootstart::$_lib[ 'Core_Loader' ]->library( array( 'HtmlTable' ) );
        Bootstart::$_lib[ 'Core_Loader' ]->model( array( 'OrderData' ) );
        # ----------------------------------------------------------------------
        # 初始化變數
        # ----------------------------------------------------------------------
        $list = "";
        # ----------------------------------------------------------------------
        # 取出所有餐盒資料
        # ----------------------------------------------------------------------
        $dataArr =  Bootstart::$_mod[ 'OrderData_Model' ]->getOrderdata( Core_LoadSession( 'id' ) );
        # ----------------------------------------------------------------------
        # 防呆 有資料才做
        # ----------------------------------------------------------------------
        if( $dataArr[ "f" ] )
        {
            # ------------------------------------------------------------------
            # 產生 Table
            # ------------------------------------------------------------------
            Bootstart::$_lib[ 'Core_HtmlTable' ]->add_table( '' , 'table' );
            Bootstart::$_lib[ 'Core_HtmlTable' ]->add_TSection( 'thead', 'thead-primary' );
            Bootstart::$_lib[ 'Core_HtmlTable' ]->add_row();
            Bootstart::$_lib[ 'Core_HtmlTable' ]->add_cell( '訂單號' , 'th' );
            Bootstart::$_lib[ 'Core_HtmlTable' ]->add_cell( '訂購日期' , 'th' );
            Bootstart::$_lib[ 'Core_HtmlTable' ]->add_cell( '訂購內容' , 'th' );
            Bootstart::$_lib[ 'Core_HtmlTable' ]->add_cell( '金額' , 'th' );
            Bootstart::$_lib[ 'Core_HtmlTable' ]->add_cell( '狀態' , 'th' );
            Bootstart::$_lib[ 'Core_HtmlTable' ]->add_cell( '備註' , 'th' );
            Bootstart::$_lib[ 'Core_HtmlTable' ]->add_TSection( 'tbody' );
            # ------------------------------------------------------------------
            # 狀態對照
            # ------------------------------------------------------------------
            $status = array( 0 => '待付款', 1 => '已匯款', 2 => '已完成', 3 => '取消');
            # ------------------------------------------------------------------
            # 產生tr
            # ------------------------------------------------------------------
            foreach( $dataArr[ "f" ] as $key => $val )
            {
                # --------------------------------------------------------------
                # 未付款 要多處理付款連結
                # --------------------------------------------------------------
                if( $val[ 'status' ] == 0 )
                {
                    $pay = '<a href="'.DEVIL_APP_Url.__CLASS__."/Pay/".$val['id'].'">'.$status[ $val[ 'status' ] ].'</a>'; 
                }
                else
                {
                    $pay = $status[ $val[ 'status' ] ];
                }
                # --------------------------------------------------------------
                # tr
                # --------------------------------------------------------------
                Bootstart::$_lib[ 'Core_HtmlTable' ]->add_row();
                Bootstart::$_lib[ 'Core_HtmlTable' ]->add_cell( $val[ 'order_id' ] );
                Bootstart::$_lib[ 'Core_HtmlTable' ]->add_cell( date( "Y-m-d H:i:s", $val[ 'createtime' ] ) );
                Bootstart::$_lib[ 'Core_HtmlTable' ]->add_cell( $val[ 'content' ] );
                Bootstart::$_lib[ 'Core_HtmlTable' ]->add_cell( intval( $val[ 'amount' ] ) );
                Bootstart::$_lib[ 'Core_HtmlTable' ]->add_cell( $pay );
                Bootstart::$_lib[ 'Core_HtmlTable' ]->add_cell( $val[ 'note' ] );
            }
            # ------------------------------------------------------------------
            # 產生所有設定的表格資料
            # ------------------------------------------------------------------
            $list = Bootstart::$_lib[ 'Core_HtmlTable' ]->generate();
        }
        else
        {
            $list = '<div class="alert alert-info alert-dismissible">
                        <h5><i class="icon fas fa-info"></i> 無任何資料！！</h5>
                    </div>';
        }
        # ----------------------------------------------------------------------
        # 輸出內容
        # ----------------------------------------------------------------------
        $this->My_HtmlView->Extension_HtmlView
        (
            "Order_Page" ,
            "Order.html" ,
            array
            (
                # --------------------------------------------------------------
                # 站名
                # --------------------------------------------------------------
                "TITLE" => DEVIL_APP_PROJECT_NAME ,
                # --------------------------------------------------------------
                # JS、CSS、圖片等的存取網址
                # --------------------------------------------------------------
                "PUBLIC_URL" => DEVIL_APP_PUBLIC_URL ,
                # --------------------------------------------------------------
                # 當前網址
                # --------------------------------------------------------------
                "URL" => DEVIL_APP_Url ,
                # --------------------------------------------------------------
                # 內容
                # --------------------------------------------------------------
                "LIST" => $list
            )
        );
    }

    /**
    @brief      付款資料
    **/
    public function Pay( $_id )
    {
        # ----------------------------------------------------------------------
        # 過濾
        # ----------------------------------------------------------------------
        $id = intval( $_id );
        # ----------------------------------------------------------------------
        # 手動載入需要的類別
        # ----------------------------------------------------------------------
        Bootstart::$_lib[ 'Core_Loader' ]->library( array( 'HtmlTable' ) );
        Bootstart::$_lib[ 'Core_Loader' ]->model( array( 'OrderData' ) );
        # ----------------------------------------------------------------------
        # 初始化變數
        # ----------------------------------------------------------------------
        $list = "";
        # ----------------------------------------------------------------------
        # 取出所有餐盒資料
        # ----------------------------------------------------------------------
        $dataArr =  Bootstart::$_mod[ 'OrderData_Model' ]->getOrderdataById( $id );
        # ----------------------------------------------------------------------
        # 防呆 有資料才做
        # ----------------------------------------------------------------------
        if( $dataArr )
        {
            $list = '<div class="col-md-10">
                            <div class="form-group">
                                <span>訂單號：'.$dataArr["order_id"].'</span>
                            </div>
                        </div>
                        <div class="w-100"></div>
                        <div class="col-md-10">
                            <div class="form-group">
                                <span>付款金額：'.intval( $dataArr["amount"] ).'</span>
                            </div>
                        </div>
                        <div class="w-100"></div>
                        <div class="col-md-10">
                            <div class="form-group">
                                <span>戶名：林健智</span>
                            </div>
                        </div>
                        <div class="w-100"></div>
                        <div class="col-md-10">
                            <div class="form-group">
                                <span>銀行代碼：822</span>
                            </div>
                        </div>                        
                        <div class="w-100"></div>
                        <div class="col-md-10">
                            <div class="form-group">
                                <span>銀行名稱：中國信託 文心分行</span>
                            </div>
                        </div>
                        <div class="w-100"></div>
                        <div class="col-md-10">
                            <div class="form-group">
                                <span>銀行帳號：473600070805</span>
                            </div>
                        </div>';
        }
        else
        {
            $list = '<div class="alert alert-info alert-dismissible">
                        <h5><i class="icon fas fa-info"></i> 無任何資料！！</h5>
                    </div>';
        }
        //core_predie($list);
        # ----------------------------------------------------------------------
        # 輸出內容
        # ----------------------------------------------------------------------
        $this->My_HtmlView->Extension_HtmlView
        (
            "OrderPay_Page" ,
            "OrderPay.html" ,
            array
            (
                # --------------------------------------------------------------
                # 站名
                # --------------------------------------------------------------
                "TITLE" => DEVIL_APP_PROJECT_NAME ,
                # --------------------------------------------------------------
                # JS、CSS、圖片等的存取網址
                # --------------------------------------------------------------
                "PUBLIC_URL" => DEVIL_APP_PUBLIC_URL ,
                # --------------------------------------------------------------
                # 當前網址
                # --------------------------------------------------------------
                "URL" => DEVIL_APP_Url ,
                # --------------------------------------------------------------
                # 內容
                # --------------------------------------------------------------
                "LIST" => $list
            )
        );
    }

}