<?php if ( ! defined( 'DEVIL_SYS_CORE_PATH' ) ) exit( 'No direct script access allowed' );
/**
  @brief        Register Controller ( 註冊 )
**/

class Register extends Controller
{
    /**
    @brief      建構子
    **/
    public function __construct()
    {
        # ----------------------------------------------------------------------
        # 呼叫父類別建構子
        # ----------------------------------------------------------------------
        parent::__construct();
        # ----------------------------------------------------------------------
        # 先將核心自動載入的類別實例化至當前類別中
        # ----------------------------------------------------------------------
        parent::__initialization();
    }

    /**
    @brief      登入後 看到的第一頁 ( 首頁 )
    **/
    public function index(  )
    {
        # ----------------------------------------------------------------------
        # 輸出內容
        # ----------------------------------------------------------------------
        Bootstart::$_lib[ 'My_HtmlView' ]->Extension_HtmlView
        (
            __CLASS__."_Page" ,
            __CLASS__.".html" ,
            array
            (
                # --------------------------------------------------------------
                # 當前網址
                # --------------------------------------------------------------
                "URL" => DEVIL_APP_Url ,
                # --------------------------------------------------------------
                # JS、CSS、圖片等的存取網址
                # --------------------------------------------------------------
                "PUBLIC_URL" => DEVIL_APP_PUBLIC_URL ,
                # --------------------------------------------------------------
                # 網頁 TITLE
                # --------------------------------------------------------------
                "TITLE" => DEVIL_APP_PROJECT_NAME ,
                # --------------------------------------------------------------
                # 註冊
                # --------------------------------------------------------------
                "ADDURL" => DEVIL_APP_Url . __CLASS__ . '/addRegister' ,
            )
        );
    }

    /**
    @brief      處理註冊
    **/
    public function addRegister(  )
    {
        if( Core_IsPost() && $_POST != '' )
        {
            # ------------------------------------------------------------------
            # 檢查『mail』
            # ------------------------------------------------------------------
            if( ! isset( $_POST[ "mail" ] ) )
            {
                echo "<script>alert('mail不得為空，請重新輸入！！');window.history.back(-1);</script>";die();
            }
            # ------------------------------------------------------------------
            # 檢查『密碼』
            # ------------------------------------------------------------------
            if( ! isset( $_POST[ "password" ] ) )
            {
                echo "<script>alert('密碼不得為空，請重新輸入！！');window.history.back(-1);</script>";die();
            }
            # ------------------------------------------------------------------
            # 檢查『確認密碼』
            # ------------------------------------------------------------------
            if( ! isset( $_POST[ "rpassword" ] ) )
            {
                echo "<script>alert('確認密碼不得為空，請重新輸入！！');window.history.back(-1);</script>";die();
            }
            # ------------------------------------------------------------------
            # 檢查『密碼』、『確認密碼』 是否相同
            # ------------------------------------------------------------------
            if( $_POST[ "password" ] != $_POST[ "rpassword" ] )
            {
                echo "<script>alert('密碼、確認密碼不相同，請重新輸入！！');window.history.back(-1);</script>";die();
            }
            # ------------------------------------------------------------------
            # 檢查『姓名』
            # ------------------------------------------------------------------
            if( ! isset( $_POST[ "name" ] ) )
            {
                echo "<script>alert('真實姓名不得為空，請重新輸入！！');window.history.back(-1);</script>";die();
            }
            # ------------------------------------------------------------------
            # 手動載入需要的類別
            # ------------------------------------------------------------------
            Bootstart::$_lib[ 'Core_Loader' ]->library( array( 'Pdo_Driver' ) );
            Bootstart::$_lib[ 'Core_Loader' ]->model( array( 'Users' ) );
            # ------------------------------------------------------------------
            # 檢查帳號是否存在
            # ------------------------------------------------------------------
            $userArr = Bootstart::$_mod[ 'Users_Model' ]->getUser( $_POST[ "mail" ] );
            # ------------------------------------------------------------------
            # 存在直接輸出中斷
            # ------------------------------------------------------------------
            if( $userArr )
            {
                echo "<script>alert('帳號已註冊！！');window.history.back(-1);</script>";die();
            }
            # ------------------------------------------------------------------
            # 檢查『行動電話』
            # ------------------------------------------------------------------
            if( ! isset( $_POST[ "phone" ] ) )
            {
                echo "<script>alert('行動電話不得為空，請重新輸入！！');window.history.back(-1);</script>";die();
            }
            # ------------------------------------------------------------------
            # 檢查『住址』
            # ------------------------------------------------------------------
            if( ! isset( $_POST[ "address" ] ) )
            {
                echo "<script>alert('地址不得為空，請重新輸入！！');window.history.back(-1);</script>";die();
            }
            # ------------------------------------------------------------------
            # 組成資訊
            # ------------------------------------------------------------------
            $insertArr = array();
            $insertArr[ 'account' ] = $_POST[ "mail" ];
            $insertArr[ 'email' ] = $_POST[ "mail" ];
            $insertArr[ 'pass' ] = md5( $_POST[ "password" ] );
            $insertArr[ 'name' ] = $_POST[ "name" ];
            $insertArr[ 'phone' ] = $_POST[ "phone" ];
            $insertArr[ 'address' ] = $_POST[ "address" ];
            $insertArr[ 'createdt' ] = time();
            # ------------------------------------------------------------------
            # 執行
            # ------------------------------------------------------------------
            if( Bootstart::$_lib[ 'Core_Pdo_Driver' ]->db_insert( 'k_user' , $insertArr ) === FALSE )
            {
                echo "<script>alert('註冊失敗，請重新操作！！');window.history.back(-1);</script>";die();
            }
            else
            {
                echo "<script>alert('註冊成功,購物去！！');</script>";
                echo "<script>window.location.href='".DEVIL_APP_Url.'/BuyCart'."';</script>";
            }
        }
    }
}